INSERT INTO weizhu_team 
  (company_id, team_id, team_name, parent_team_id, state)
VALUES
  (0, 1, '时代光华', NULL, 'NORMAL'),
  (0, 2, '移动学习事业部', 1, 'NORMAL'),
  (0, 3, '微助内容咨询组', 2, 'NORMAL'),
  (0, 4, '微助产品开发组', 2, 'NORMAL');
  
INSERT INTO weizhu_position
  (company_id, position_id, position_name, position_desc, state)
VALUES
  (0, 1, '总经理', '总经理', 'NORMAL'),
  (0, 2, '经理', '经理', 'NORMAL'),
  (0, 3, '咨询顾问', '咨询顾问', 'NORMAL'),
  (0, 4, 'android开发工程师', 'android开发工程师', 'NORMAL'),
  (0, 5, 'ios开发工程师', 'ios开发工程师', 'NORMAL'),
  (0, 6, '后台开发工程师', '后台开发工程师', 'NORMAL'),
  (0, 7, '软件测试', '软件测试', 'NORMAL'),
  (0, 8, '交互设计师', '交互设计师', 'NORMAL');
  
  
INSERT INTO weizhu_level
  (company_id, level_id, level_name, state)
VALUES
  (0, 1, '工程师', 'NORMAL'),
  (0, 2, '高级工程师', 'NORMAL');


INSERT INTO weizhu_user_base 
  (company_id, user_id, raw_id, raw_id_unique, user_name, gender, avatar, email, signature, interest, is_expert, level_id, state) 
VALUES 
  (0, 10000124196, '57', '57', '林栋', 'MALE', 'ec1a00e4710bb3bd5289615db7a8e4ecf7811884.jpg', 'lindong@21tb.com', NULL, NULL, 0, 2, 'NORMAL'),
  (0, 10000124207, '53', '53', '方文杰', 'MALE', '95ac4c21923821299e46d2791a7abf89ab1788ec.jpg', 'fangwenjie@21tb.com', NULL, NULL, 0, 2, 'NORMAL'),
  (0, 10000124194, '1579', '1579', '王淼', 'MALE', 'd4508c9ff326a425d58aead1fef56f7b5376b4af.jpg', 'wangmiao@21tb.com', '老K', '篮球、音乐', 1, NULL, 'NORMAL'),
  (0, 10000124212, '2006', NULL, '宫德龙', 'MALE', NULL, 'gongdelong@21tb.com', 'U can,U up, No can,No BB.', '打麻将，听歌，旅游，在家呆着', 0, 1, 'DELETE'),
  (0, 10000124209, '2000', '2000', '龚宁', 'MALE', '6809ee24b3aefaef1416743cf154dd1ecece4410.jpg', 'gongning@21tb.com', '世界自有公道，付出才有回报，说到就要做到，要做就做最好。', '看动漫、听音乐、看电影', 0, 1, 'NORMAL'),
  (0, 10000124211, '63', '63', '李亚莉', 'FEMALE', '491bf32dfb1ce1f9dcfb99b5675c9bab59e78ef8.jpg', 'liyali@21tb.com', '有事没事多笑笑，生活才不会烦恼', '吃喝玩乐', 0, 1, 'NORMAL'),
  (0, 10000124188, '1889', '1889', '谢丽娜', 'FEMALE', NULL, 'xielina@21tb.com', '你简单，世界就对你简单', '旅游，户外运动', 0, NULL, 'NORMAL'),
  (0, 10000124189, '1740', '1740', '高原', 'MALE', '7d7e93f7320390f7532f058c410fcd5392b687f2.jpg', 'gaoyuan1740@21tb.com', '颤抖吧凡人们！！！', '游戏、潜水、聊天', 1, NULL, 'NORMAL'),
  (0, 10000124203, '1970', '1970', '任洁', 'FEMALE', '464cded8b8de02956801177a45473807e1dad0b9.jpg', 'renjie@21tb.com', '哲学活动如果不是思想对自己的批判工作，那又是什么呢？如果它不是致力于认识如何及在多大程度上能够以不同的方式思维，而是证明已经知道的东西，那么它有什么意义呢？', '绘画、烹饪、购物、电影、韩剧、动漫', 0, NULL, 'NORMAL');

INSERT INTO weizhu_user_base_mobile_no 
  (company_id, user_id, mobile_no, mobile_no_unique) 
VALUES 
  (0, 10000124196, '18601191171', '18601191171'),
  (0, 10000124207, '13913589112', '13913589112'),
  (0, 10000124207, '18511371185', '18511371185'),
  (0, 10000124194, '13910538391', '13910538391'),
  (0, 10000124212, '15911064399', NULL),
  (0, 10000124209, '18610895341', '18610895341'),
  (0, 10000124209, '18634931828', '18634931828'),
  (0, 10000124211, '15910318525', '15910318525'),
  (0, 10000124188, '18810450562', '18810450562'),
  (0, 10000124189, '13701358621', '13701358621'),
  (0, 10000124189, '18600478621', '18600478621'),
  (0, 10000124203, '15110297859', '15110297859');
  
INSERT INTO weizhu_user_base_phone_no
  (company_id, user_id, phone_no)
VALUES
  (0, 10000124194, '82894959'),
  (0, 10000124188, '82894959'),
  (0, 10000124189, '82894959'),
  (0, 10000124203, '7825');
  
INSERT INTO weizhu_user_mark
  (company_id, marker_id, user_id, is_star, star_time, mark_name)
VALUES
  (0, 10000124196, 10000124207, 1, 1415867762, 'clarkfang');

INSERT INTO weizhu_user_team 
  (company_id, user_id, team_id, position_id)
VALUES
  (0, 10000124196, 4, 6),
  (0, 10000124207, 4, 4),
  (0, 10000124194, 3, 2),
  (0, 10000124212, 4, 5),
  (0, 10000124209, 4, 5),
  (0, 10000124211, 4, 7),
  (0, 10000124188, 3, 3),
  (0, 10000124189, 2, 1),
  (0, 10000124203, 4, 8);
  
INSERT INTO weizhu_user_extends
  (company_id, user_id, `name`, `value`)
VALUES
  (0, 10000124196, '测试', '值');
  
INSERT INTO weizhu_user_experience
  (company_id, user_id, experience_id, experience_content)
VALUES
  (0, 10000124196, 1, '手机腾讯网财经股票频道开发'),
  (0, 10000124196, 2, '腾讯微博手机wap版后台开发'),
  (0, 10000124196, 3, '腾讯微博客户端后台开发'),
  
  (0, 10000124194, 1, '微助'),
  
  (0, 10000124212, 1, '比你惨'),
  (0, 10000124212, 2, '飞库小说'),
  (0, 10000124212, 3, '看书客户端'),
  (0, 10000124212, 4, '娱乐秀场'),
  
  (0, 10000124209, 1, '听吧'),
  (0, 10000124209, 2, '随手看新闻'),
  (0, 10000124209, 3, 'lifefun'),

  (0, 10000124211, 1, '视频会议开发'),
  
  (0, 10000124188, 1, '参与《大咖教你做呈现》系列微视频的拍摄、脚本撰写、视频制作等过程'),
  (0, 10000124188, 2, '参与销售流程、SPI等为内容的开发'),
  (0, 10000124188, 3, '参与“2014年时代光华竞争对手分析报告”的撰写'),
  
  (0, 10000124189, 1, '微助项目'),
  
  (0, 10000124203, 1, '搜索引擎'),
  (0, 10000124203, 2, '电子商务'),
  (0, 10000124203, 3, 'O2O'),
  (0, 10000124203, 4, '行业门户');
  
INSERT INTO weizhu_user_ability_tag
  (company_id, user_id, tag_name, create_user_id, create_time)
VALUES
  (0, 10000124196, '哈哈', 10000124196, 123),
  (0, 10000124212, '老朴', 10000124196, 1423020679),
  (0, 10000124212, '朴社长', 10000124196, 1423020679),
  (0, 10000124212, '天哪！', 10000124196, 1423020679),
  (0, 10000124212, '退下', 10000124196, 1423020679),
  (0, 10000124212, '妩媚动人', 10000124196, 1423020679),
  (0, 10000124209, '小伙儿', 10000124196, 1423020679),
  (0, 10000124207, '克拉克', 10000124196, 1423020679),
  (0, 10000124207, 'clarkfang', 10000124196, 1423020679),
  (0, 10000124189, 'steven', 10000124196, 1423020679);
  
INSERT INTO weizhu_user_ability_tag_user
  (company_id, user_id, tag_user_id, tag_name, tag_time)
VALUES
  (0, 10000124196, 10000124212, '哈哈', 123),
  (0, 10000124212, 10000124196, '老朴', 1423020679),
  (0, 10000124212, 10000124196, '朴社长', 1423020679),
  (0, 10000124212, 10000124196, '天哪！', 1423020679),
  (0, 10000124212, 10000124196, '退下', 1423020679),
  (0, 10000124211, 10000124196, '削他!!!', 1423020679),
  (0, 10000124209, 10000124196, '小伙儿', 1423020679),
  (0, 10000124207, 10000124196, '克拉克', 1423020679),
  (0, 10000124207, 10000124196, 'clarkfang', 1423020679),
  (0, 10000124189, 10000124196, 'steven', 1423020679);
